of70/tutorials/rheoHeatFoam/OtherTests/cavity/Newtonian/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p_rgh|U)"
    {        
        solverType       eigenSolver; 
         
        solver           BiCGSTAB;
                  
        saveSystem               true;
        updatePrecondFrequency   -1;
        updateMatrixCoeffs       true;
        
        tolerance        1e-12;
        maxIter          1000;
       
        preconditioner
        {
            preconditioner       ILUT;
            dropTol              1e-80;
            fillFactor           200;
        }       
    }

    T
    {

        solver           PBiCG;
        preconditioner
        {
            preconditioner DILU;
        }

        tolerance         1e-8;
        relTol            0;
        minIter           0;
        maxIter           1000;
    }
 
}

 

SIMPLE
{
    nInIter         1;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
        
    }
}

relaxationFactors
{
    
}

// ************************************************************************* //
